app/controllers/events_controller.rb

SELECT "events".* FROM "events"
---
  def index
    render json: Event.all

INSERT INTO "events" ("name", "description", "start_date", "event_venue_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    event = Event.new(event_params)
    if event.save

UPDATE "events" SET "description" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["description", "Puro testinggggg"], ["updated_at", "2019-04-11 20:45:06.331979"], ["id", 4]]
---
  def update
    if @event.update(event_params)

SELECT "events".* FROM "events" WHERE "events"."start_date" BETWEEN ? AND ?  [["start_date", "2019-04-11"], ["start_date", "2019-07-11"]]
---
  def upcoming_events
    render json: Event.where(start_date: Time.now .. 3.months.from_now)