app/controllers/tickets_controller.rb

  def index
    if params[:ticket_type_id]
      render json: TicketType.find(params[:ticket_type_id]).tickets
    else
      render json: Ticket.all
---
SELECT  "ticket_types".* FROM "ticket_types" WHERE "ticket_types"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "tickets".* FROM "tickets" WHERE "tickets"."ticket_type_id" = ?  [["ticket_type_id", 3]]
SELECT "tickets".* FROM "tickets"