app/controllers/ticket_types_controller.rb

SELECT "ticket_types".* FROM "ticket_types"
---
  def index
    render json: TicketType.all

SELECT  "ticket_types".* FROM "ticket_types" WHERE "ticket_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_ticket_type
      @ticket_type = TicketType.find(params[:id])