app/controllers/users_controller.rb

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("name", "lastname", "email", "password", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def user_with_most_tickets
    user_tickets = User.joins(orders: :tickets).group(:user_id).order('count_all desc').count
    user_with_most_tickets_id = user_tickets.first.first
    render json: User.find(user_with_most_tickets_id)
---
SELECT COUNT(*) AS count_all, "user_id" AS user_id FROM "users" INNER JOIN "orders" ON "orders"."user_id" = "users"."id" INNER JOIN "tickets" ON "tickets"."order_id" = "orders"."id" GROUP BY "user_id" ORDER BY count_all desc
SELECT "users".* FROM "users" INNER JOIN "orders" ON "orders"."user_id" = "users"."id" INNER JOIN "tickets" ON "tickets"."order_id" = "orders"."id" GROUP BY "user_id"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]